import { useState } from "react";

export const Text = () => {
  const [text] = useState([
    {
      text: "「自分が行動したことすべては取るに足らないことかもしれない。しかし、行動したというそのことが重要なのである」",
      name: "ガンジー",
    },
    {
      text: "「目を奪われるものがたくさんあるだろう。しかし、心奪われるものだけを追い求めなさい」",
      name: "ネイティブアメリカンの教え",
    },
    {
      text: "「人生はどちらかです。勇気をもって挑むか、棒にふるか」",
      name: "ヘレンケラー",
    },
    {
      text: "「失敗することを恐れるよりも、真剣でないことを恐れたほうがいい」",
      name: "松下幸之助",
    },
    {
      text: "「今日が人生の最後の日だとして、今日これからやることは本当にやりたいことか？もし、何日もの間「NO」という答えが続いた時は、何かを変えなければならない。Stay hungry, stay foolish.」",
      name: "ステーブ・ジョブズ",
    },
    {
      text: "「痛いのは生きているから、転んだのは歩いたから、迷っているのは前に進みたいから、逃げ出したいのはたたかっているから」",
      name: "作者不明",
    },
    {
      text: "「止まりさえしなければ、どんなにゆっくりでも進めばよい」",
      name: "孔子",
    },
    {
      text: "「険しい丘に登るためには、最初にゆっくり歩くことが必要である」",
      name: "シェイクスピア",
    },
    { text: "「未来とは、今である」", name: "マーガレット・ミード" },
    { text: "「人生とは今日一日のことである」", name: "デール・カーネギー" },
    { text: "「うまく使えば、時間はいつも十分にある」", name: "ゲーテ" },
    {
      text: "「過去も未来も存在せず、あるのは現在と言う瞬間だけだ」",
      name: "トルストイ",
    },
    {
      text: "「学ぶのに、時間を費やしすぎるのは、怠惰である」",
      name: "フランシス・ベーコン",
    },
    {
      text: "「時間を上手く使うためには、「明日できることは、あえて今日しない」ことが大切なのです」",
      name: "山西健一郎",
    },
    { text: "「その日その日が一年中の最善の日である」", name: "エマーソン" },
    {
      text: "「事を成し遂げる秘訣は、ただ一つの事に集中することにある」",
      name: "リンカーン",
    },
    {
      text: "「自分にはできないかも知れないという恐れに真正面から立ち向かうたびに、あなたは強さと自信と経験を勝ち取るのです。だから、できないと思うことに挑戦してごらんなさい」",
      name: "エレノア・ルーズベルト",
    },
    {
      text: "「最も重要な決定とは、何をするかではなく、何をしないかを決めることだ」",
      name: "スティーブ・ジョブズ",
    },
    {
      text: "「人生あまり難しく考えなさんな。暗かったら窓を開けろ、光がさしてくる」",
      name: "中村天風",
    },
    {
      text: "「辛い思いはすべてプラスになる。苦しかったこと、悲しかったことが、いつか必ず花開く時が来る。辛いこと、悲しいことは幸せになるための必要事項。花開き、実を結ぶときに辞めてしまってはいけない」",
      name: "美輪明宏",
    },
    {
      text: "「いいかい、怖かったら怖いほど、逆にそこに飛び込むんだ」",
      name: "岡本太郎",
    },
    {
      text: "「何でも思い切ってやってみることですよ。どっちに転んだって人間、野辺の石ころ同様、骨となって一生を終えるのだから」",
      name: "坂本龍馬",
    },
    {
      text: "「馬鹿になれ、とことん馬鹿になれ、恥をかけ、とことん恥をかけ、かいてかいて恥かいて、裸になったら見えてくる、本当の自分が見えてくる、本当の自分も笑ってた、それくらい馬鹿になれ」",
      name: "アントニオ猪木",
    },
    {
      text: "「朝、希望を持って目覚め、昼は懸命に働き、夜は感謝と共に眠る」",
      name: "麻生太郎",
    },
    {
      text: "「人間、今が一番若いんだよ。明日より今日の方が若いんだから。いつだって、その人にとって今が一番若いんだよ。」",
      name: "永六輔",
    },
    { text: "「笑われて、笑われて、つよくなる」", name: "太宰治" },
    {
      text: "「楽しんで失敗する方が、退屈しながら成功するよりいい」",
      name: "ジョージ・バーン",
    },
    { text: "「飲め！」", name: "フランソワ・ラブレー" },
    {
      text: "「ミスをしない者とは、何もしようとしない人間のことだ」",
      name: "セオドア・ルーズベルト",
    },
    {
      text: "「死ぬことばかり考えてしまうのは、きっと生きる事に真面目すぎるから」",
      name: "秋田ひろむ",
    },
    {
      text: "「今日という日は、残りの人生の最初の日である」",
      name: "チャールズ・ディードリッヒ",
    },
    {
      text: "「人は成功に向かってつまずく」",
      name: "メアリー・ケイ・アッシュ",
    },
    {
      text: "「何事も成功するまでは不可能に思えるものである」",
      name: "ネルソン・マンデラ",
    },
    {
      text: "「目標を達成するには、全力で取り組む以外に方法はない。そこに近道はない」",
      name: "マイケル・ジョーダン",
    },
    {
      text: "「人生の初期において最大の危険は、リスクを犯さないことにある」",
      name: "キルケゴール",
    },
    {
      text: "「努力は必ず報われる。もし報われない努力があるのならば、それはまだ努力と呼べない」",
      name: "王貞治",
    },
    {
      text: "「やったことは、例え失敗しても、20年後には、笑い話にできる。しかし、やらなかったことは、20年後には、後悔するだけだ」",
      name: "マーク・トウェイン",
    },
    {
      text: "「この瞬間、瞬間に、若さとか、年よりとか、力があるないとか、才能とか、金とか、あらゆる条件を超えて、その持てるぎりぎりいっぱいの容量で挑み、生きるということだ」",
      name: "岡本太郎",
    },
    {
      text: "「我々は、最初から苦しむ方向をとったから、あとは楽になった。真似をして楽をしたものは、その後に苦しむことになる」",
      name: "本田宗一郎",
    },
    {
      text: "「できると思えばできる、できないと思えばできない。これは、ゆるぎない絶対的な法則である」",
      name: "パブロ・ピカソ",
    },
    { text: "「未来はすでに始まっている」", name: "ロベルト・ユンク" },
    {
      text: "「苦しいから逃げるのではない。逃げるから苦しくなるのだ」",
      name: "ウィリアム・ジェームズ",
    },
    {
      text: "「逆境とは、天が自分の宝石を磨くときに使うダイヤの粉塵のことだ」",
      name: "トーマス・カーライル",
    },
    {
      text: "「不安もプレッシャーもありますが、それをはねのけられるのは、納得できる練習しかないんです」",
      name: "谷亮子",
    },
    {
      text: "「他人と比較して、他人が自分より優れていたとしても、それは恥ではない。しかし、去年の自分より今年の自分が優れていないのは立派な恥だ」",
      name: "ジョン・ラボック",
    },
    {
      text: "「成功への道が完結することはありえない。成功とは、到達すべき目的地ではなく、前進し続けるプロセスなのだ」",
      name: "アンソニー・ロビンズ",
    },
    {
      text: "「どこに行っても逃げて歩いていたなら、自信は失われるばかりです」",
      name: "エレノア・ルーズベルト",
    },
    {
      text: "「自分がどんなに努力しても、すぐに結果が出るとは限らない。結果にこだわりすぎると安全な道を選び、進歩は止まってしまう」",
      name: "藤沢秀行",
    },
    {
      text: "「今日の成果は過去の努力の結果であり、未来はこれからの努力で決まる」",
      name: "稲盛和夫",
    },
    {
      text: "「天才なんかあるものか。僕は他人がコーヒーを飲んでいる時間に仕事をしただけだ」",
      name: "魯迅",
    },
    {
      text: "「怠慢は魅力的に見えるけど、満足感を与えてくれるのは働くこと」",
      name: "アンネ・フランク",
    },
    {
      text: "「人間にとって成功とはいったいなんだろう。結局のところ、自分の夢に向かって自分がどれだけ挑んだか、努力したかどうか、ではないだろうか。」",
      name: "岡本太郎",
    },
    { text: "「人生は楽ではない。そこが面白い。」", name: "武者小路実篤" },
    {
      text: "「今日一日、怒らず、恐れず、悲しまず、正直、親切、愉快に生きよ。」",
      name: "中村天風",
    },
    {
      text: "「心の底からやりたいと思わないなら、やめておけ。」",
      name: "ヘミングウェイ",
    },
    {
      text: "「女は、人生で一度や二度は、ワルい男を愛してしまうの。でもだからこそ、イイ男に出会ったとき、感謝する気持ちになれるのよ。」",
      name: "マージョリー・キナン・ローリングス",
    },
  ]);

  const [selectText, setSelectText] = useState(null);

  const handleClick = () => {
    const randomText = Math.floor(Math.random() * text.length);
    setSelectText(text[randomText]);
  };

  return (
    <div className="main-wrap">
      <button onClick={handleClick} className="btn-emergency">
        <span className="btn-emergency-bottom"></span>
        <span className="btn-emergency-top">
          <span>押す</span>
        </span>
      </button>
      <div className="text-warp">
          {selectText && (
            <div className="text">
              <p>{selectText.text}</p>
              <p>{selectText.name}</p>
            </div>
          )}
      </div>
    </div>
  );
};
